cypress/fixtures/confirmResponse/success.json

{
    "task_id": "cache",
    "data": {
        "channel": "P24WEB",
        "message": "",
        "payments": [
            {
                "aCard": "5309233034765085",
                "amount": "5.00",
                "bName": "Kyivstar Ukraine",
                "commission": "2.0",
                "currency": "UAH",
                "description": "Mobile payment. Phone number +380939034410",
                "link": "mobipay",
                "pmErrorCode": "",
                "ref": "P24A840893376C32988"
            }
        ],
        "result": "accept",
        "timestamp": "1608914439709"
     },
    "ref": "payments_36d91022d70aceb3e26b41dd1b1b4981f944b36e",
    "status": "success"
}